# Задача 0 Напишите программу, которая 
# 1. на вход принимает число и 
# 2. выдаёт его квадрат (число умноженное на само себя).

n = int(input('Введите число: '))
print(n * n)